name: Windows Get-AdComputer Unconstrained Delegation Discovery
id: 3672edd5-6ec6-4156-b9e1-3aee26afb500
author: john.doe@dkolabs.com
last_updated: '2019-01-22'
version: 1
description: This analytic leverages Event Id 4768. A Kerberos authentication ticket (TGT) was requested to identify one source endpoint trying to obtain an unusual number of Kerberos TGT tickets for non-existing users. This behavior could represent an adversary abusing the Kerberos protocol to perform a user enumeration attack against an Active Directory environment. When Kerberos is sent a TGT request with no preauthentication for an invalid username, it responds with KRB5KDC_ERR_C_PRINCIPAL_UNKNOWN or 0x6.
search: |-
  index=powershell EventCode=4104 (ScriptBlockText = "*Get-ADComputer*" AND ScriptBlockText = "*TrustedForDelegation*") 
  | stats count min(_time) as firstTime max(_time) as lastTime by EventCode ScriptBlockText Computer UserID 
  | rename Computer as dest 
  | rename UserID as user
tags:
  - endpoint
  - powershell
mitre:
  - T1018
references:
  - https://learn.microsoft.com/en-us/defender-for-identity/security-assessment-unconstrained-kerberos
  - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/domain-compromise-via-unrestricted-kerberos-delegation