name: Azure - SSPR
description: |
  Returns Self Service Password Resets performed via Azure.
last_updated: 2021-06-01
version: 1.0
indexes:
  - azure
tags:
  - authentication
search: |
  index=azure operationName="Self Service Password Reset"
  | eval datetime=strftime(_time, "%F %T %Z")
  | table datetime, user, src_ip, status